#include <stdio.h>
#include <math.h>

int main() {
    int x1, y1, r1, x2, y2, r2;
    scanf("%i %i %i %i %i %i", &x1, &y1, &r1, &x2, &y2, &r2);
    if (r1 >= r2){
        double d = sqrt(pow(x2 - x1, 2) + pow(y2 - y1, 2));
        if (d > (r1 + r2)){
            printf("Окружности не пересекаются, одна вне другой");
        }
        if (d == (r1 + r2)){
            printf("Внешнее касание, одна общая точка");
        }
        if ((d > (r1 - r2)) && (d < (r1 + r2))){
            printf("Окружности пересекаются, 2 общие точки");
        }
        if (d == (r1 - r2)){
            printf("Внутреннее касание, одна общая точка");
        }
        if (d < (r1 - r2)){
            printf("Окружности не пересекаются, одна внутри другой");
        }
    }
    if (r1 < r2){
        double d = sqrt(pow(x2 - x1, 2) + pow(y2 - y1, 2));
        if (d > (r1 + r2)){
            printf("Окружности не пересекаются, одна вне другой");
        }
        if (d == (r1 + r2)){
            printf("Внешнее касание, одна общая точка");
        }
        if ((d > (r2 - r1)) && (d < (r1 + r2))){
            printf("Окружности пересекаются, 2 общие точки");
        }
        if (d == (r2 - r1)){
            printf("Внутреннее касание, одна общая точка");
        }
        if (d < (r2 - r1)){
            printf("Окружности не пересекаются, одна внутри другой");
        }
    }
}
